package com.company;
    /*Создать класс Student, содержащий следующие характеристики –
    имя, группа, курс, оценки по предметам.
    Создать коллекцию, содержащую объекты класса Student.
    Написать метод, который удаляет студентов со средним баллом < 3.
    Если средний балл>=3, студент переводится на следующий курс.
    Напишите метод printStudents(List<com.company.students.Student> students, int course),
    который получает список студентов и номер курса и печатает на консоль имена тех студентов из списка,
    которые обучаются на данном курсе.
    а) Создать динамический массив, содержащий объекты класса Student.
    б) Раcпечатать его содержимое используя for each.
    в) Изменить вес первого ящика на 1.
    г) Удалить последнего студента.
    д) Получить массив содержащий студентов из коллекции тремя способами и вывести на консоль.
    е) Удалить все ящики.
    Использовать массив ArrayList
    ArrayList<имя> имя = new ArrayList<имя>(); -это список для хранения объектов Имя
    имя.add(new Имя("Петрушка"));*/

public class Main {

        public static void main(String[] args) {



        }
}
        



